smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
smash> smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> smash> smash> my_sleep
new_random1.txt
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> smash> smash> my_sleep
new_random1.txt
new_random2.txt
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> smash> smash> my_sleep
new_random1.txt
new_random2.txt
new_temp_file
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> smash> my_sleep
new_random1.txt
new_random2.txt
new_temp_file
new_temp_file2
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> smash> my_sleep
new_random1.txt
new_random2.txt
new_temp_file
new_temp_file2
new_temp_file3
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> smash: got ctrl-C
smash: process 10689 was killed
smash> smash> smash: got ctrl-Z
smash: process 10690 was stopped
smash> [1] cp /dev/zero /dev/null : 10690 2 secs (stopped)
smash> cp /dev/zero /dev/null : 10690
smash> [1] cp /dev/zero /dev/null : 10690 3 secs
smash> signal number 9 was sent to pid 10690
smash> smash> smash: got ctrl-C
smash: process 10691 was killed
smash> smash> [1] cp /dev/zero /dev/null& : 10692 0 secs
smash> cp /dev/zero /dev/null& : 10692
smash: got ctrl-C
smash: process 10692 was killed
smash> smash> smash error: touch: invalid arguments
smash> my_sleep
new_random1.txt
new_random2.txt
new_temp_file
new_temp_file2
new_temp_file3
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> cp: cannot stat 'empty_file': No such file or directory
smash> my_sleep
new_random1.txt
new_random2.txt
new_temp_file
new_temp_file2
new_temp_file3
random1.txt
random2.txt
sub1
sub2
sub3
temp_file
smash> cmp: empty_file: No such file or directory
smash> smash> smash> smash> cp: cannot create regular file '/not/exisits/dir/bla': No such file or directory
smash> cp: cannot stat '/not/exisits/dir/bla': No such file or directory
smash> smash> cp: 'random1.txt' and 'random1.txt' are the same file
smash> smash> cp: '/tmp/smash_test/random1.txt' and 'random1.txt' are the same file
smash> smash> cp: 'random1.txt' and '/tmp/smash_test/random1.txt' are the same file
smash> smash> cp: '/tmp/smash_test/random1.txt' and '/tmp/smash_test/random1.txt' are the same file
smash> smash> cp: cannot stat 'doesnt_exist.txt': No such file or directory
smash> subsub1
smash> smash> random1.txt
subsub1
smash> smash> 