smash> my_sleep
random1.txt
random2.txt
sub1
sub2
sub3
smash> smash> test_redirect
smash> smash> again_redirect
smash> smash> again_redirect
test_redirect
smash> smash> smash pid is 10071
smash> smash> smash pid is 10071
smash pid is 10071
smash> smash> smash pid is 10071
smash> my_sleep
mypid
new
random1.txt
random2.txt
sub1
sub2
sub3
smash> smash> smash> smash> smash error: kill: invalid arguments
smash> cat: k: No such file or directory
smash> smash error: kill: invalid arguments
smash> cat: t: No such file or directory
smash> my_sleep
mypid
new
random1.txt
random2.txt
s
sub1
sub2
sub3
smash> smash> my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
smash> my_sleep
mypid
new
p
random1.txt
random2.txt
s
sub1
sub2
sub3
smash> smash error: open failed: No such file or directory
smash error: open failed: No such file or directory
/bin/bash: line 0: echo: write error: Bad file descriptor
cat: standard output: Bad file descriptor
smash error: open failed: Permission denied
ls: write error: Bad file descriptor
cat: standard output: Bad file descriptor
ls: write error: Bad file descriptor
cat: standard output: Bad file descriptor
ls: write error: Bad file descriptor
cat: standard output: Bad file descriptor
cat: standard output: Bad file descriptor
cat: standard output: Bad file descriptor
smash error: kill: job-id 2 does not exist
cat: standard output: Bad file descriptor
