smash> submitted by Eran
smash> smash> smash> smash> smash> smash> sleep 200& : 5523
smash: got ctrl-Z
smash: process 5523 was stopped
smash> [1] sleep 100& : 5522 1 secs
[2] sleep 200& : 5523 0 secs (stopped)
smash> sleep 100& : 5522
smash: got ctrl-C
smash: process 5522 was killed
smash> [2] sleep 200& : 5523 2 secs (stopped)
smash> smash> sleep 300& : 5673
smash: got ctrl-Z
smash: process 5673 was stopped
smash> [2] sleep 200& : 5523 3 secs (stopped)
[3] sleep 300& : 5673 0 secs (stopped)
smash> smash: sending SIGKILL signal to 2 jobs:
5523: sleep 200&
5673: sleep 300&
